---
alias: "set 命令"
---

### set 命令 

#redis #set

set 命令用于新增或更新键值对。具体是新增还是更新，取决于该键值对原本是否存在。

> [!command] 语法：
> SET &lt;key> &lt;value>

- set 一个『不存在』的 key ，就是『新增』一个键值对；
- set 一个『已存在』的 key ，就是『更新』这个键值对。

### set 命令示例

```bash
# 对不存在的键进行设置
> SET key "value"
OK

> GET key
"value"

# 对已存在的键进行设置
> SET key "new-value"
OK

# 取值，验证
> GET key
"new-value"
```

### 带参数的 set 命令 

> [!command] key 不存在，才设置：
>
>  ```sh
>  SET key val NX
>  ```
  
这是真正意义上的『新增』操作，因为要求之前是必须没有的。

> [!command] key 存在，才设置
>
>  ```sh
>  SET key val XX
>  ```
  
这是真正意义上的『更新』操作，因为要求之前是必须有的。



