[
  "obsidian-image-auto-upload-plugin",
  "obsidian-admonition",
  "lapel",
  "obsidian-quiet-outline",
  "table-extended",
  "calendar",
  "obsidian-columns",
  "obsidian-dynamic-embed",
  "highlightr-plugin",
  "obsidian-style-settings",
  "hk-code-block"
]